#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-prod-sso-requests/runs/run-Fjyd43QbpN6VGdsd

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=7pXWFg]
random_password.db_password: Refreshing state... [id=none]
aws_api_gateway_resource.proxy: Refreshing state... [id=aqhevc]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-kgodz1zmk2-aqhevc-ANY]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-kgodz1zmk2-aqhevc-ANY]
module.s3_ocp.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-ocp]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
module.s3_sso_api_swagger.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-api-swagger]
module.s3_sysdig.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-sysdig]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=kgodz1zmk2]
aws_dynamodb_table.state_locking: Refreshing state... [id=xgr00q-prod-state-locking]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:751704728437:certificate/842691e5-ab99-440d-8818-d4b9e623eec3]
aws_iam_role.api_gateway_s3_role: Refreshing state... [id=ApiGatewayAmazonS3AccessRole]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-prod-keycloak]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_api_gateway_resource.openapi_swagger: Refreshing state... [id=smd25o]
aws_api_gateway_resource.api: Refreshing state... [id=l8vstw]
aws_api_gateway_resource.actions: Refreshing state... [id=vw6kd8]
aws_api_gateway_resource.app: Refreshing state... [id=sniyra]
aws_api_gateway_resource.openapi_swagger_proxy: Refreshing state... [id=8c4eij]
aws_api_gateway_resource.swagger_assets_proxy: Refreshing state... [id=fxl742]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cn65f5]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=5k4vgg]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_method.openapi_swagger_proxy: Refreshing state... [id=agm-kgodz1zmk2-8c4eij-GET]
aws_security_group.rds_sg: Refreshing state... [id=sg-0cbc5116a7eb44966]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api.loginproxy.gov.bc.ca]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-006d5ccf7acdb99cc]
aws_api_gateway_method.swagger_assets_proxy: Refreshing state... [id=agm-kgodz1zmk2-fxl742-GET]
module.s3_ocp.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-ocp]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-kgodz1zmk2-cn65f5-ANY]
module.s3_ocp.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_ocp.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-ocp]
module.s3_ocp.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-ocp,private]
module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-api-swagger]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-kgodz1zmk2-5k4vgg-ANY]
module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-api-swagger]
module.s3_sso_api_swagger.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-api-swagger,private]
module.s3_sysdig.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_sysdig.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-sysdig]
module.s3_sysdig.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-sysdig,private]
module.s3_sysdig.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-sysdig]
aws_s3_object.swagger_dist["swagger-initializer.js"]: Refreshing state... [id=swagger-initializer.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"]: Refreshing state... [id=swagger-ui-es-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"]: Refreshing state... [id=swagger-ui-standalone-preset.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"]: Refreshing state... [id=swagger-ui-es-bundle-core.js.map]
aws_s3_object.swagger_dist["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.swagger_dist["swagger-output.json"]: Refreshing state... [id=swagger-output.json]
aws_s3_object.swagger_dist["oauth2-redirect.html"]: Refreshing state... [id=oauth2-redirect.html]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"]: Refreshing state... [id=swagger-ui-es-bundle-core.js]
aws_s3_object.swagger_dist["absolute-path.js"]: Refreshing state... [id=absolute-path.js]
aws_s3_object.swagger_dist["swagger-ui.css.map"]: Refreshing state... [id=swagger-ui.css.map]
aws_s3_object.swagger_dist["swagger-ui-bundle.js"]: Refreshing state... [id=swagger-ui-bundle.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"]: Refreshing state... [id=swagger-ui-es-bundle.js]
aws_s3_object.swagger_dist["swagger-ui.js.map"]: Refreshing state... [id=swagger-ui.js.map]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"]: Refreshing state... [id=swagger-ui-standalone-preset.js.map]
aws_s3_object.swagger_dist["index.js"]: Refreshing state... [id=index.js]
aws_s3_object.swagger_dist["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"]: Refreshing state... [id=swagger-ui-bundle.js.map]
aws_s3_object.swagger_dist["README.md"]: Refreshing state... [id=README.md]
aws_s3_object.swagger_dist["swagger-ui.css"]: Refreshing state... [id=swagger-ui.css]
aws_s3_object.swagger_dist["package.json"]: Refreshing state... [id=package.json]
aws_s3_object.swagger_dist["swagger-ui.js"]: Refreshing state... [id=swagger-ui.js]
aws_s3_object.swagger_dist["index.css"]: Refreshing state... [id=index.css]
aws_s3_object.swagger_dist["index.html"]: Refreshing state... [id=index.html]
aws_api_gateway_method_response.openapi_swagger_proxy: Refreshing state... [id=agmr-kgodz1zmk2-8c4eij-GET-200]
aws_api_gateway_method_response.swagger_assets_proxy: Refreshing state... [id=agmr-kgodz1zmk2-fxl742-GET-200]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-prod-keycloak,private]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-prod-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-prod-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-prod-keycloak]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=g92x81]
aws_api_gateway_integration.openapi_swagger_assets: Refreshing state... [id=agi-kgodz1zmk2-fxl742-GET]
aws_api_gateway_integration.openapi_swagger: Refreshing state... [id=agi-kgodz1zmk2-8c4eij-GET]
aws_iam_role_policy.s3_read_access_policy: Refreshing state... [id=ApiGatewayAmazonS3AccessRole:AWSS3ResourceReadAccessRolePolicy]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210903190658559400000001]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_integration_response.openapi_swagger_assets: Refreshing state... [id=agir-kgodz1zmk2-fxl742-GET-200]
aws_api_gateway_integration_response.openapi_swagger: Refreshing state... [id=agir-kgodz1zmk2-8c4eij-GET-200]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-3019186098]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-kgodz1zmk2-cn65f5-ANY]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-kgodz1zmk2-5k4vgg-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=gtj2ip]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-10-21T18:26:24.170Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2022-09-02T18:11:58Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:751704728437:kgodz1zmk2/test" -> (known after apply)
      ~ id            = "gtj2ip" -> (known after apply)
      ~ invoke_url    = "https://kgodz1zmk2.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "4bf16175fd1910052eda81e3adea15ca1832c8c4"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.app will be created
  + resource "aws_api_gateway_integration" "app" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kgodz1zmk2"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:751704728437:function:lambda-app/invocations"
    }

  # aws_api_gateway_integration.lambda will be destroyed
  - resource "aws_api_gateway_integration" "lambda" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "aqhevc" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "ANY" -> null
      - id                      = "agi-kgodz1zmk2-aqhevc-ANY" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "aqhevc" -> null
      - rest_api_id             = "kgodz1zmk2" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:751704728437:function:lambda-app/invocations" -> null
    }

  # aws_api_gateway_method.app_proxy will be created
  + resource "aws_api_gateway_method" "app_proxy" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kgodz1zmk2"
    }

  # aws_api_gateway_method.proxy will be destroyed
  - resource "aws_api_gateway_method" "proxy" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "ANY" -> null
      - id                   = "agm-kgodz1zmk2-aqhevc-ANY" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "aqhevc" -> null
      - rest_api_id          = "kgodz1zmk2" -> null
    }

  # aws_api_gateway_resource.app_proxy will be created
  + resource "aws_api_gateway_resource" "app_proxy" {
      + id          = (known after apply)
      + parent_id   = "sniyra"
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = "kgodz1zmk2"
    }

  # aws_api_gateway_resource.proxy will be destroyed
  - resource "aws_api_gateway_resource" "proxy" {
      - id          = "aqhevc" -> null
      - parent_id   = "sniyra" -> null
      - path        = "/app/{proxy+}" -> null
      - path_part   = "{proxy+}" -> null
      - rest_api_id = "kgodz1zmk2" -> null
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-10-21T18:26:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "r51Yn9y5D051O3wN7LyOX9Lq+JbC04u+yttYktFIhUU=" -> "BURr6Qm2IW8nUa6L/E5CDSEBadh/IUwcH1D4vxnn368="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-10-21T18:26:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "KB4Ql972cQf3wjzkqGB3zdMUl3gS1WJJVX0UyUPZkDw=" -> "NHJ0EI2fBMRV6zQUd/JVSrSvqKCZfZjQF3vfwWHEYZ4="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2022-10-21T18:26:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "1t63m7RXYpQ0OiUTsyI6dp6pZe8HEqQpFTgqR5fJ8VI=" -> "YIEet+AApoGEyaphlJCwUxEtbd7PbXDOem9TWkMVri0="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-10-21T18:26:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "BcTru17qJiqGNUJ2l/2ekvZWfamLtOBlrI5nlkIsvDA=" -> "aL3qCjzoeioj4cudzOhxDqM0BZe4+RNCDExriXTwX6k="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-10-21T18:26:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "FqnRHRWIWKQ9adEihGIS5/q/xY0ZLGChbS+Z2wKC0Jk=" -> "K5/dfUnx4yeKdEmBuKvlHhTZBLhlvlHF3QaL0SV7VR4="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (25 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_s3_object.swagger_dist["swagger-output.json"] will be updated in-place
  ~ resource "aws_s3_object" "swagger_dist" {
      ~ etag               = "b039c55731ef107690ca648330632524" -> "3034981810d9c4d076e3dbc7e3a4139c"
        id                 = "swagger-output.json"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 4 to add, 6 to change, 4 to destroy.

Changes to Outputs:
  ~ base_url     = "https://kgodz1zmk2.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-10-21T18:26:24.170Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 40 estimated
           $178.56/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*